classdef params
    % param用于保存整个仿真模型的参数，包括常量参数和
    % 变量参数，常量参数无法更改，变量可以更改
    properties
        W0 = 100.0;  % (变量)初始体重(kg)
        H = 1.70; % (变量)身高(m)
        T = 7.0;    % (变量)每周运动时间(h)
        A1 = 1/9000 % (常量)吸收热量与增加体重系数(kg/kcal)
        A2 = 1/7700 % (常量)消耗热量与减少体重系数(kg/kcal)
        B1 = 250.0 % (常量，初始可调)1kg体重每周正常代谢消耗热量(kcal/kg*周)
        B2 = 9.0    % (常量，初始可调)1kg体重每小时跑步消耗热量(kcal/(h*kg))
        J = 1.0     % (常量，初始可调)每周吸收热量减少量
        J0 = 15000  % (变量)第一周吸收的热量
    end
    
    methods
    end
end

